EmbeddedSystemClass/remote_control_51822/nRF51822_App/source/Application/ble_top_implementation.c
/**
  ****************************************************************************************
  * @file    ble_top_implementation.c
  * @author  Jason
  * @version V1.0.0
  * @date    2016-11-25
  * @brief   ble communication top level implementation
  ****************************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2016 Chengdu CloudCare Healthcare Co., Ltd.</center></h2>
  *
  ****************************************************************************************
  */
#include "ble_top_implementation.h"





/* peripheral related. */
#define DEVICE_NAME                      "NordicLESCApp"                            /**< Name of device used for advertising. */
#define MANUFACTURER_NAME                "NordicSemiconductor"                      /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                 40                                        /**< The advertising interval (in units of 0.625 ms). This value corresponds to 187.5 ms. */
#define APP_ADV_TIMEOUT_IN_SECONDS       60                                        /**< The advertising timeout in units of seconds. */

#define FIRST_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER) /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY    APP_TIMER_TICKS(30000, APP_TIMER_PRESCALER)/**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT     3                                          /**< Number of attempts before giving up the connection parameter negotiation. */




/* private variables define */
APP_TIMER_DEF(m_ble_scanCTL_timer_id);                              /**<ble scan control timer. */
APP_TIMER_DEF(m_ble_char_find_manage_timer_id);                     /**<timer to poll the status of character find manage. */
APP_TIMER_DEF(m_ble_connect_bonding_status_poll_timer_id);          /**<timer to poll the status of connect and bonding. */
APP_TIMER_DEF(m_ble_reconnect_timer_id);                            /**<timer for ble reconnect control. */


/* private function declare */
static void ble_stack_init(void);
static void sys_evt_dispatch(uint32_t sys_evt);
static void ble_evt_dispatch(ble_evt_t * p_ble_evt);
static void db_discovery_init(void);
static void db_disc_handler(ble_db_discovery_evt_t * p_evt);
static void gap_params_init(void);
static void conn_params_init(void);
static void conn_params_error_handler(uint32_t nrf_error);
static void advertising_init(void);
//static void on_adv_evt(ble_adv_evt_t ble_adv_evt);
static ret_code_t start_ble_scan(void);
static ret_code_t stop_ble_scan(void);
static void services_init(void);
static uint32_t ble_central_service_init(void);
static void vTimerStopBleScanCB(void * p_context);
static void vTimerCharFindStatusPollCB(void *p_context);
static void vTimerConnectBondingStatusPollCB(void *p_context);
static void vTimerBleReconnectCB(void * p_context);
static void reset_scan_list(void);
static void reset_target_Connnect_DevInfo(void);
static ret_code_t ble_central_connect_target(ble_gap_addr_t *peerAddr);
static ret_code_t ble_central_disconnect_target(uint16_t conn_handle);

/**
  * @brief  ble_init
  * @param  None
  * @retval None
  */
void ble_init(void)
{	
    g_DeviceInformation.conn_handle = BLE_CONN_HANDLE_INVALID;
    g_DeviceInformation.char_find_manage = YWK_CHARACTER_NONE;
    g_DeviceInformation.isNRFBusy = false;
       
	/* ble stack init */
	ble_stack_init();	
	db_discovery_init();
	gap_params_init();
	conn_params_init();
	services_init();
    ble_central_service_init();
	advertising_init();	
}
/**
  * @brief  ble_task_handler
  * @param  *p_event_data,event_size
  * @retval None
  */
void ble_task_handler(void *p_event_data,uint16_t event_size)
{
    BLE_MSG_T               *bleRxEventMsgValue = (BLE_MSG_T *)p_event_data;
    BLE_MSG_T               bleEventMsgValue; 
    uint32_t                err_code = NRF_ERROR_NULL;
    uint8_t                 i = 0;
   

     
    /* 接收到消息，对消息事件进行处理 */
    switch(bleRxEventMsgValue->eventID)
    {
        case EVENT_APP_BLE_START_SCAN:
        {
            #ifdef DEBUG_BLE_SCAN
                printf("start scan\r\n");
            #endif
            /* start ble scan */
            start_ble_scan();
            
            /* 清空扫描列表 */
            reset_scan_list();
            
            /* stop the timer of scan control */
            err_code = app_timer_stop(m_ble_scanCTL_timer_id);
            APP_ERROR_CHECK(err_code);
                       
            /* start the timer of scan control */
            err_code = app_timer_start(m_ble_scanCTL_timer_id,STOP_SCAN_TIME,NULL);
            APP_ERROR_CHECK(err_code);  
        }
        break;
        case EVENT_APP_BLE_STOP_SCAN:
        {
            #ifdef DEBUG_BLE_SCAN
                printf("stop scan\r\n");
            #endif 
            
            /* stop ble scan */
            stop_ble_scan();
            
            /* reset the target connnect device info */
            reset_target_Connnect_DevInfo();
            
            /* 找出扫描列表中最大信号质量强度对应的手环 */
            for(i=0;i<MAX_SCAN_LIST_NUM;i++)
            {
                if(gScanList[i].isValid == false)  //说明在扫描事件中已将填充对应的扫描列表位置
                {
                    if(g_DeviceInformation.rssi < gScanList[i].rssi)
                    {                      
                        g_DeviceInformation.rssi = gScanList[i].rssi;
                        g_DeviceInformation.sn = (uint32_t)((uint32_t)(gScanList[i].sn[0]<<24) + (uint32_t)(gScanList[i].sn[1]<<16) +
                                                            (uint32_t)(gScanList[i].sn[2]<<8) + (uint32_t)(gScanList[i].sn[3]));
                        memcpy(&g_DeviceInformation.MACaddr,&gScanList[i].MACaddr,sizeof(ble_gap_addr_t));
                        g_DeviceInformation.isValid = true;
                    }
                }                                
            }
            
            if(g_DeviceInformation.isValid == true)  //说明找到了可以连接的设备
            {
                #ifdef DEBUG_BLE_BONDING
                    printf("target SN:%d,Mac:0x%x,0x%x,0x%x,0x%x,0x%x,0x%x,type:%d\r\n",g_DeviceInformation.sn,
                                            g_DeviceInformation.MACaddr.addr[0],
                                            g_DeviceInformation.MACaddr.addr[1],
                                            g_DeviceInformation.MACaddr.addr[2],
                                            g_DeviceInformation.MACaddr.addr[3],
                                            g_DeviceInformation.MACaddr.addr[4],
                                            g_DeviceInformation.MACaddr.addr[5],
                                            g_DeviceInformation.MACaddr.addr_type
                            );
                #endif
                /* 发送连接蓝牙连接事件 */
                bleEventMsgValue.eventID = EVENT_APP_BLE_CONNECT;
                err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
                APP_ERROR_CHECK(err_code); 
            }
            else  //未找到可以连接的设备
            {
                //@todo
                #ifdef DEBUG_BLE_BONDING
                    printf("not find the device to connnect\r\n");
                #endif
            }
        }
        break;
        case EVENT_APP_BLE_CONNECT:
        {
            /* 连接设备 */
            err_code = ble_central_connect_target(&g_DeviceInformation.MACaddr);
            APP_ERROR_CHECK(err_code); 
        }
        break;
        case EVENT_APP_BLE_DISCONNECT:
        {
            /* 主动断开设备连接 */
            err_code = ble_central_disconnect_target(g_DeviceInformation.conn_handle);
            APP_ERROR_CHECK(err_code);
        }
        break;
        case EVENT_APP_BLE_PASSKEY_WRITE:
        {
            /* 写PIN码 */
            ble_central_passkey_write(&g_DeviceInformation);
        }
        break;
        case EVENT_APP_BLE_BONDING_OK:
        {
            /* passkey confirm ok */
            app_cmu_ble_connect_status_send(g_DeviceInformation.sn,g_DeviceInformation.MACaddr.addr,true);
        }
        break;
        case EVENT_APP_BLE_SYNC_TIME:
        {
            /* 同步peer设备时间 */
            if(g_setTimeValue != 0)
            {
                ble_central_synctime_write(&g_DeviceInformation,g_setTimeValue);
                app_cmu_time_set_status_rsp(g_DeviceInformation.sn,true);
            }
        }
        break;
        case EVENT_APP_BLE_MONITOR_TEMPLATE_WRITE:
        {            
            /* 设置监护方案 */            
            ble_central_monitor_template_write(&g_DeviceInformation);
        }
        break;
        case EVENT_APP_BLE_SERVICE_CHAR_FIND_COMPLATE:
        {
            #ifdef DEBUG_BLE_BONDING
                printf("EVENT_APP_BLE_SERVICE_CHAR_FIND_COMPLATE\r\n");
            #endif
                       
