EmbeddedSystemClass/remote_control_51822/nRF51822_App/source/Application/ble_top_implementation.c
            /* set the g_connect_bonding_status to STATUS_WRITE_PIN */
            g_connect_bonding_status = STATUS_WRITE_PIN;
            
            /* start the timer to poll the status of connect and bonding */
            stop_connect_bonding_status_polling_timer_timer(&g_DeviceInformation);
            start_connect_bonding_status_polling_timer_timer(&g_DeviceInformation);
        }
        break;
        default:break;
    }
}

/**
  * @brief  allocate an app timer to control the ble scan
  * @param  None
  * @retval None
  */
void ble_scan_control_timer_init(void)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
    
    err_code = app_timer_create(&m_ble_scanCTL_timer_id,APP_TIMER_MODE_SINGLE_SHOT,vTimerStopBleScanCB);
    APP_ERROR_CHECK(err_code);    
}
/**
  * @brief  start the time of polling the status of character find management
  * @param  *p_dev
  * @retval None
  */
void start_character_find_status_manage_timer(DeviceInfomation_t *p_dev)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
     
    /* start the timer of polling the status of character find management */
    err_code = app_timer_start(m_ble_char_find_manage_timer_id,FIND_CHAR_STATUS_POLL_TIME,p_dev);
    APP_ERROR_CHECK(err_code); 
}
/**
  * @brief  stop the time of polling the status of character find management
  * @param  *p_dev
  * @retval None
  */
void stop_character_find_status_manage_timer(DeviceInfomation_t *p_dev)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
    
    /* stop the timer of character find status polling */
    err_code = app_timer_stop(m_ble_char_find_manage_timer_id);
    APP_ERROR_CHECK(err_code);
}

/**
  * @brief  allocate an app timer to reconnect the peers when ble disconnect
  * @param  None
  * @retval None
  */
void ble_reconnect_timer_init(void)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
    
    err_code = app_timer_create(&m_ble_reconnect_timer_id,APP_TIMER_MODE_REPEATED,vTimerBleReconnectCB); 
    APP_ERROR_CHECK(err_code);    
}
/**
  * @brief  start the time of ble reconnect
  * @param  *p_dev
  * @retval None
  */
void start_ble_reconnect_timer(DeviceInfomation_t *p_dev)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
     
    /* start the timer of polling the status of character find management */
    err_code = app_timer_start(m_ble_reconnect_timer_id,BLE_RECONNECT_TIME,p_dev);
    APP_ERROR_CHECK(err_code); 
}
/**
  * @brief  stop the time of ble reconnect
  * @param  *p_dev
  * @retval None
  */
void stop_ble_reconnect_timer(DeviceInfomation_t *p_dev)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
    
    /* stop the timer of character find status polling */
    err_code = app_timer_stop(m_ble_reconnect_timer_id);
    APP_ERROR_CHECK(err_code);
}


/**
  * @brief  allocate an app timer to poll the status of connect and bonding progress
  * @param  None
  * @retval None
  */
void ble_connect_bonding_status_polling_timer_init(void)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
    
    err_code = app_timer_create(&m_ble_connect_bonding_status_poll_timer_id,APP_TIMER_MODE_REPEATED,vTimerConnectBondingStatusPollCB); 
    APP_ERROR_CHECK(err_code);    
}
/**
  * @brief  start the time of polling the status of connect and bonding
  * @param  *p_dev
  * @retval None
  */
void start_connect_bonding_status_polling_timer_timer(DeviceInfomation_t *p_dev)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
     
    /* start the timer of polling the status of character find management */
    err_code = app_timer_start(m_ble_connect_bonding_status_poll_timer_id,CONNECT_BONDING_STATUS_POLL_TIME,p_dev);
    APP_ERROR_CHECK(err_code); 
}
/**
  * @brief  stop the time of polling the status of connect and bonding
  * @param  *p_dev
  * @retval None
  */
void stop_connect_bonding_status_polling_timer_timer(DeviceInfomation_t *p_dev)
{
    ret_code_t  err_code = NRF_ERROR_NULL;
    
    /* stop the timer of character find status polling */
    err_code = app_timer_stop(m_ble_connect_bonding_status_poll_timer_id);
    APP_ERROR_CHECK(err_code);
}

/**
  * @brief  ble_connect_bonding_tatus_execute
  * @note   the execute of connect and bonding status
  * @param  CONNECT_BONDING_STATUS_T status
  * @retval None
  */
uint32_t ble_connect_bonding_tatus_execute(CONNECT_BONDING_STATUS_T status)
{
    BLE_MSG_T               bleEventMsgValue;
    APP_DATA_SYNC_MSG_T     syncDataEventMsgValue;
    uint32_t                err_code = NRF_ERROR_NULL;
    
    if(g_DeviceInformation.isNRFBusy == false)
    {        
        /* polling the status of connect and bonding progress */
        switch(status)
        {
            case STATUS_WRITE_PIN:
            {
                bleEventMsgValue.eventID = EVENT_APP_BLE_PASSKEY_WRITE;
                
                err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
                APP_ERROR_CHECK(err_code);
            }
            break;
            case STATUS_WRITE_TIME:
            {
                bleEventMsgValue.eventID = EVENT_APP_BLE_SYNC_TIME;
                
                err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
                APP_ERROR_CHECK(err_code);    
            }
            break;
            case STATUS_WRITE_MONITOR_TEMPLATE:
            {
                bleEventMsgValue.eventID = EVENT_APP_BLE_MONITOR_TEMPLATE_WRITE;
                
                err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
                APP_ERROR_CHECK(err_code); 
            }
            break;
            case STATUS_START_SYNC_DATA:
            {
                syncDataEventMsgValue.eventID = EVENT_APP_DATA_SYNC_START_SYNC_DATA;

                err_code = app_sched_event_put(&syncDataEventMsgValue,sizeof(syncDataEventMsgValue),app_data_sync_task_handler);
                APP_ERROR_CHECK(err_code); 
            }
            break;
            default:break;            
        }
    }
    else  //nRF busy
    {
        err_code = NRF_ERROR_BUSY;
    }
    return err_code;
}

/**@brief Function for start ble scanning.
 */
static ret_code_t start_ble_scan(void)
{
    ret_code_t      err_code = NRF_SUCCESS;
    uint32_t        count = 0;

    //check if there are no flash operations in progress
    err_code = fs_queued_op_count_get(&count);
    APP_ERROR_CHECK(err_code);

    if (count == 0)
    {
        // Start scanning for peripherals and initiate connection to devices which
        // advertise Heart Rate or Running speed and cadence UUIDs.
        scan_start();  
    }
    
    return err_code;
}
/**
  * @brief  Function for stopping ble scan. 
  * @param  None
  * @retval ret_code_t
  */
static ret_code_t stop_ble_scan(void)
{
    ret_code_t      err_code = NRF_SUCCESS;  

