EmbeddedSystemClass/remote_control_51822/nRF51822_App/source/Application/ble_top_implementation.c
    err_code = ble_conn_params_init(&cp_init);
    APP_ERROR_CHECK(err_code);
}
/**@brief Function for handling database discovery events.
 * @details This function is callback function to handle events from the database discovery module.
 *          Depending on the UUIDs that are discovered, this function should forward the events
 *          to their respective services.
 * @param[in] p_event  Pointer to the database discovery event.
 * @retval None
 */
static void db_disc_handler(ble_db_discovery_evt_t * p_evt)
{
    ble_bonding_db_discovery_evt_handler(&g_DeviceInformation, p_evt);
    ble_devinfo_manage_db_discovery_evt_handler(&g_DeviceInformation, p_evt);
    ble_monitor_template_db_discovery_evt_handler(&g_DeviceInformation, p_evt);
    ble_sync_data_db_discovery_evt_handler(&g_DeviceInformation, p_evt);
}

/**
  * @brief  Database discovery initialization.
  * @note   Database discovery initialization. 
  * @param  None
  * @retval None
  */
static void db_discovery_init(void)
{
    ret_code_t err_code = ble_db_discovery_init(db_disc_handler);
    APP_ERROR_CHECK(err_code);
    
    /* allocate a timer to poll the status of character find management */
    err_code = app_timer_create(&m_ble_char_find_manage_timer_id,APP_TIMER_MODE_REPEATED,vTimerCharFindStatusPollCB);
    APP_ERROR_CHECK(err_code);
}

/**
  * @brief  Function for initializing the Advertising functionality.
  * @note   Function for initializing the Advertising functionality.
  * @param  None
  * @retval None
  */
static void advertising_init(void)
{
//    uint32_t               				err_code;
//    ble_advdata_t          				advdata;
//	ble_advdata_t              			scanrsp;
//    ble_adv_modes_config_t 				options;
//	ble_uuid_t 							scanrsp_uuids[] = {BLE_UUID_PASSKEY_AUTH_SERVICE,BLE_UUID_TYPE_BLE};
//    ble_uuid_t							adv_uuids[] = {CHECK_UP_UUID_SERVICE,BLE_UUID_TYPE_BLE};

//    // Build advertising data struct to pass into @ref ble_advertising_init.
//    memset(&advdata, 0, sizeof(advdata));

//    advdata.name_type               = BLE_ADVDATA_FULL_NAME;
//    advdata.include_appearance      = true;
//    advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
//    advdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
//    advdata.uuids_complete.p_uuids  = adv_uuids;


//	memset(&scanrsp, 0, sizeof(scanrsp));
//    scanrsp.uuids_complete.uuid_cnt = sizeof(scanrsp_uuids) / sizeof(scanrsp_uuids[0]);
//    scanrsp.uuids_complete.p_uuids  = scanrsp_uuids;
//	
//    memset(&options, 0, sizeof(options));
//    options.ble_adv_fast_enabled  = true;
//    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
//    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

//    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
//    APP_ERROR_CHECK(err_code);

}
/**
  * @brief  Function for initializing the service
  * @note   Function for initializing the service
  * @param  None
  * @retval None
  */
static void services_init(void)
{

}
/**
  * @brief  Function for initializing the ble central service
  * @param  None
  * @retval status
  */
static uint32_t ble_central_service_init(void)
{
    uint32_t    ret = NRF_ERROR_INVALID_PARAM;
    
    ret = ble_central_service_bonding_init(&g_DeviceInformation.bonding_service);
    APP_ERROR_CHECK(ret);
    
    ret = ble_central_service_monitor_template_init(&g_DeviceInformation.monitor_template_service);
    APP_ERROR_CHECK(ret);    
    
    ret = ble_central_service_devinfo_manage_init(&g_DeviceInformation.devinfo_manage_service);
    APP_ERROR_CHECK(ret); 

    ret = ble_central_service_sync_data_init(&g_DeviceInformation.sync_data_service);
    APP_ERROR_CHECK(ret);
    
    return ret;
}
/**
  * @brief  vTimerStopBleScanCB
  * @note   stop ble scan timer call back
  * @param  void * p_context
  * @retval None
  */
static void vTimerStopBleScanCB(void * p_context)
{
    BLE_MSG_T               bleEventMsgValue;
    uint32_t                err_code = NRF_ERROR_NULL;
    
    bleEventMsgValue.eventID = EVENT_APP_BLE_STOP_SCAN;
    
    err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
    APP_ERROR_CHECK(err_code);    
}
/**
  * @brief  vTimerCharFindStatusPollCB
  * @note   polling the status of character find manage
  * @param  void * p_context
  * @retval None
  */
static void vTimerCharFindStatusPollCB(void *p_context)
{
    ret_code_t              err_code = NRF_ERROR_NULL;
    DeviceInfomation_t      *dev = (DeviceInfomation_t *)p_context;
    BLE_MSG_T               bleEventMsgValue;
    dev = dev;
        
    if(g_DeviceInformation.char_find_manage == YWK_CHARACTER_ALL)  //所有的character已发现完成
    {
        /* stop the timer of character find status polling */
        err_code = app_timer_stop(m_ble_char_find_manage_timer_id);
        APP_ERROR_CHECK(err_code);
        
        #ifdef DEBUG_BLE_CONNECT
            printf("YWK character find complete:0x%x\r\n",g_DeviceInformation.char_find_manage);
        #endif
 
        bleEventMsgValue.eventID = EVENT_APP_BLE_SERVICE_CHAR_FIND_COMPLATE;
        
        err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
        APP_ERROR_CHECK(err_code);                 
    }
}

/**
  * @brief  vTimerConnectBondingStatusPollCB
  * @note   polling the status of connect and bonding status
  * @param  void * p_context
  * @retval None
  */
static void vTimerConnectBondingStatusPollCB(void *p_context)
{
    BLE_MSG_T               bleEventMsgValue;
    APP_DATA_SYNC_MSG_T     syncDataEventMsgValue;
    uint32_t                err_code = NRF_ERROR_NULL;
    
    if(g_DeviceInformation.conn_handle != BLE_CONN_HANDLE_INVALID) //蓝牙连接中
    {
        if(g_DeviceInformation.isNRFBusy == false)
        {        
            /* polling the status of connect and bonding progress */
            switch(g_connect_bonding_status)
            {
                case STATUS_WRITE_PIN:
                {
                    bleEventMsgValue.eventID = EVENT_APP_BLE_PASSKEY_WRITE;
                    
                    err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
                    APP_ERROR_CHECK(err_code);
                    
                    g_connect_bonding_status = STATUS_NONE;
                }
                break;
                case STATUS_WRITE_TIME:
                {
                    bleEventMsgValue.eventID = EVENT_APP_BLE_SYNC_TIME;
                    
                    err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
                    APP_ERROR_CHECK(err_code); 
                    
                    g_connect_bonding_status = STATUS_NONE;      
                }
                break;
                case STATUS_WRITE_MONITOR_TEMPLATE:
                {
                    bleEventMsgValue.eventID = EVENT_APP_BLE_MONITOR_TEMPLATE_WRITE;
                    
                    err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
                    APP_ERROR_CHECK(err_code); 
                    
                    g_connect_bonding_status = STATUS_NONE;
                }
                break;
                case STATUS_START_SYNC_DATA:
                {
                    syncDataEventMsgValue.eventID = EVENT_APP_DATA_SYNC_START_SYNC_DATA;

                    err_code = app_sched_event_put(&syncDataEventMsgValue,sizeof(syncDataEventMsgValue),app_data_sync_task_handler);
                    APP_ERROR_CHECK(err_code);                 
                    
                    g_connect_bonding_status = STATUS_CONNECT_BONDING_COMPLATE;
                    
