EmbeddedSystemClass/remote_control_51822/nRF51822_App/source/Application/ble_top_implementation.c
                    /* stop the time when connect and bonding progress complate */
                    stop_connect_bonding_status_polling_timer_timer(&g_DeviceInformation); 
                }
                break;
                default:break;            
            }
        }
    }
    else //蓝牙已断开
    {
        /* stop the time when connect and bonding progress complate */
        stop_connect_bonding_status_polling_timer_timer(&g_DeviceInformation);         
    }
}

/**
  * @brief  vTimerBleReconnectCB
  * @note   call back for ble reconnect
  * @param  void * p_context
  * @retval None
  */
static void vTimerBleReconnectCB(void * p_context)
{
    BLE_MSG_T               bleEventMsgValue;
    uint32_t                err_code = NRF_ERROR_NULL;   

    #ifdef DEBUG_BLE_CONNECT
        printf("ble reconnected\r\n");
    #endif    
    /* 发送连接蓝牙连接事件 */
    bleEventMsgValue.eventID = EVENT_APP_BLE_CONNECT;
    err_code = app_sched_event_put(&bleEventMsgValue,sizeof(bleEventMsgValue),ble_task_handler);
    APP_ERROR_CHECK(err_code);     
}

/**
  * @brief  reset_scan_list
  * @param  None
  * @retval None
  */
static void reset_scan_list(void)
{
    uint8_t i = 0;
    
    for(i=0;i<MAX_SCAN_LIST_NUM;i++)
    {
        memset(&gScanList[i],0,sizeof(BLE_SCAN_LIST_T));
        gScanList[i].isValid = true;
        gScanList[i].rssi = DEFAULT_REF_RSSI;
    }
}
/**
  * @brief  reset_target_Connnect_DevInfo
  * @param  None
  * @retval None
  */
static void reset_target_Connnect_DevInfo(void)
{
    memset(&g_DeviceInformation,0,sizeof(DeviceInfomation_t));
    g_DeviceInformation.isValid = false;
    g_DeviceInformation.rssi = DEFAULT_REF_RSSI;
}

/************************ (C) COPYRIGHT Chengdu CloudCare Healthcare Co., Ltd. *****END OF FILE****/

